In [1]:
import mysql.connector

connection = mysql.connector.connect(
  host = "gateway01.ap-southeast-1.prod.aws.tidbcloud.com",
  port = 4000,
  user = "3GNYKqCbbJtp9c2.root",
  password = "XQYbmm6hIa6n0Hwg",
  database = "FirstDatabase",
)

if connection.is_connected():
    print("Connection successful")
    #connection.close()
    #print("Connection closed")
else:
    print("Connection Failed")

mycursor= connection.cursor()

Connection successful

In [2]:
mycursor.execute("show databases")
for x in mycursor:
    print(x)
# print(list(mycursor.execute("show databases")))

('INFORMATION_SCHEMA',)
('FirstDatabase',)
('PERFORMANCE_SCHEMA',)
('mysql',)
('test',)

In [3]:
mycursor.execute("CREATE TABLE FirstDatabase.aadhardetails (name VARCHAR(30),ADDRESS VARCHAR(20),AADHARID INTEGER PRIMARY KEY)")

In [6]:
mycursor.execute("INSERT INTO FirstDatabase.aadhardetails (name,address,aadharid) VALUES('Nirmal','coimbatore',123456789)")
connection.commit()

In [ ]:
query = "INSERT INTO FirstDatabase.aadhardetails (name,address,aadharid) VALUES(%s, %s, %s)"

In [17]:
mycursor.execute(""" 
select * from FirstDatabase.aadhardetails
""")
out = mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out, headers=[i[0] for i in mycursor.description], showindex="always", tablefmt='psql'))

+----+---------+------------+------------+
|    | name    | ADDRESS    |   AADHARID |
|----+---------+------------+------------|
|  0 | nethaji | coimbatore |   12345678 |
|  1 | Nirmal  | coimbatore |  123456789 |
+----+---------+------------+------------+

In [10]:
mycursor.execute("""CREATE TABLE FirstDatabase.BankAccount
                 (Name VARCHAR(20),
                 type VARCHAR(2),
                 accno INT PRIMARY KEY,
                 aadhar INT ,
                 FOREIGN KEY (aadhar) REFERENCES FirstDatabase.aadhardetails(aadharid))""")

In [21]:
mycursor.execute("""INSERT INTO FirstDatabase.BankAccount 
                 (name,type,accno,aadhar) 
                 VALUES('Nirmal','SA',12445678,123456789)""")
connection.commit()

In [22]:
mycursor.execute(""" 
select * from FirstDatabase.BankAccount
""")
out = mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out, headers=[i[0] for i in mycursor.description], showindex="always", tablefmt='psql'))

+----+---------+--------+----------+-----------+
|    | Name    | type   |    accno |    aadhar |
|----+---------+--------+----------+-----------|
|  0 | nethaji | Rd     |   124455 |  12345678 |
|  1 | nethaji | Rd     |   124456 |  12345678 |
|  2 | nethaji | Rd     |  1244567 |  12345678 |
|  3 | Nirmal  | Rd     |  1244568 | 123456789 |
|  4 | Nirmal  | Rd     | 12445677 | 123456789 |
|  5 | Nirmal  | SA     | 12445678 | 123456789 |
+----+---------+--------+----------+-----------+

In [25]:
mycursor.execute(""" 
select * from SecondDB.projects
""")
out = mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out, headers=[i[0] for i in mycursor.description], showindex="always", tablefmt='psql'))

+----+--------------+--------------------+----------+--------------+-------------+
|    |   project_id | project_name       |   emp_id | start_date   | status      |
|----+--------------+--------------------+----------+--------------+-------------|
|  0 |            1 | Website Redesign   |        1 | 2024-01-15   | In Progress |
|  1 |            2 | Mobile App         |        2 | 2024-02-01   | Planning    |
|  2 |            3 | Database Migration |        3 | 2024-01-10   | Completed   |
|  3 |            4 | Security Audit     |        4 | 2024-03-01   | In Progress |
|  4 |            5 | Cloud Migration    |        1 | 2024-02-15   | Planning    |
|  5 |            6 | AI Implementation  |        5 | 2024-01-20   | On Hold     |
|  6 |            7 | CRM Update         |        7 | 2024-02-10   | In Progress |
|  7 |            8 | Network Upgrade    |        8 | 2024-03-05   | Planning    |
|  8 |            9 | Data Analytics     |        9 | 2024-01-05   | Completed   |
|  9 |           10 | DevOps Pipeline    |        3 | 2024-02-20   | In Progress |
+----+--------------+--------------------+----------+--------------+-------------+

In [33]:
mycursor.execute(""" 
insert into SecondDB.employees (emp_id, first_name, last_name, salary) VALUES
(1, 'Johnny', 'Smith', 1, 50000.00)
""")

DataError: 1136 (21S01): Column count doesn't match value count at row 1

In [26]:
mycursor.execute(""" 
select * from SecondDB.employees
""")
out = mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out, headers=[i[0] for i in mycursor.description], showindex="always", tablefmt='psql'))

+----+----------+--------------+-------------+-----------------+----------+
|    |   emp_id | first_name   | last_name   |   department_id |   salary |
|----+----------+--------------+-------------+-----------------+----------|
|  0 |        1 | John         | Smith       |               1 |    50000 |
|  1 |        2 | Sarah        | Johnson     |               2 |    62000 |
|  2 |        3 | Michael      | Brown       |               1 |    55000 |
|  3 |        4 | Emily        | Davis       |               3 |    48000 |
|  4 |        5 | David        | Wilson      |               2 |    61000 |
|  5 |        6 | Lisa         | Anderson    |               4 |    53000 |
|  6 |        7 | James        | Taylor      |               1 |    54000 |
|  7 |        8 | Emma         | Martinez    |               2 |    59000 |
|  8 |        9 | Daniel       | Thomas      |               3 |    51000 |
|  9 |       10 | Jessica      | Garcia      |               5 |    57000 |
+----+----------+--------------+-------------+-----------------+----------+

In [8]:
mycursor.execute(""" 
select * from SecondDB.departments
""")
out = mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out, headers=[i[0] for i in mycursor.description], showindex="always", tablefmt='psql'))

+----+-----------------+-------------------+---------------+----------+
|    |   department_id | department_name   | location      |   budget |
|----+-----------------+-------------------+---------------+----------|
|  0 |               1 | IT                | New York      |   500000 |
|  1 |               2 | Marketing         | Los Angeles   |   400000 |
|  2 |               3 | Finance           | Chicago       |   450000 |
|  3 |               4 | HR                | Boston        |   300000 |
|  4 |               5 | Sales             | Miami         |   550000 |
|  5 |               6 | Research          | Seattle       |   600000 |
|  6 |               7 | Operations        | Denver        |   350000 |
|  7 |               8 | Legal             | Washington DC |   425000 |
|  8 |               9 | Support           | Austin        |   275000 |
|  9 |              10 | Development       | San Francisco |   700000 |
+----+-----------------+-------------------+---------------+----------+

In [32]:
mycursor.execute(""" SELECT 
                 e.first_name, e.last_name, d.department_name, d.department_id
                FROM SecondDB.employees e
                inner JOIN SecondDB.departments d ON e.department_id = d.department_id;""")
out = mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out, headers=[i[0] for i in mycursor.description], showindex="always", tablefmt='psql'))

+----+--------------+-------------+-------------------+-----------------+
|    | first_name   | last_name   | department_name   |   department_id |
|----+--------------+-------------+-------------------+-----------------|
|  0 | John         | Smith       | IT                |               1 |
|  1 | Sarah        | Johnson     | Marketing         |               2 |
|  2 | Michael      | Brown       | IT                |               1 |
|  3 | Emily        | Davis       | Finance           |               3 |
|  4 | David        | Wilson      | Marketing         |               2 |
|  5 | Lisa         | Anderson    | HR                |               4 |
|  6 | James        | Taylor      | IT                |               1 |
|  7 | Emma         | Martinez    | Marketing         |               2 |
|  8 | Daniel       | Thomas      | Finance           |               3 |
|  9 | Jessica      | Garcia      | Sales             |               5 |
+----+--------------+-------------+-------------------+-----------------+

In [6]:
mycursor.execute("""
                 SELECT e.first_name, e.last_name, d.department_name, e.salary
                FROM SecondDB.employees e
                left JOIN SecondDB.departments d ON e.department_id = d.department_id
                 order by e.salary desc""")
out = mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out, headers=[i[0] for i in mycursor.description], showindex="always", tablefmt='psql'))

+----+--------------+-------------+-------------------+----------+
|    | first_name   | last_name   | department_name   |   salary |
|----+--------------+-------------+-------------------+----------|
|  0 | Sarah        | Johnson     | Marketing         |    62000 |
|  1 | David        | Wilson      | Marketing         |    61000 |
|  2 | Emma         | Martinez    | Marketing         |    59000 |
|  3 | Jessica      | Garcia      | Sales             |    57000 |
|  4 | Michael      | Brown       | IT                |    55000 |
|  5 | James        | Taylor      | IT                |    54000 |
|  6 | Lisa         | Anderson    | HR                |    53000 |
|  7 | Daniel       | Thomas      | Finance           |    51000 |
|  8 | John         | Smith       | IT                |    50000 |
|  9 | Emily        | Davis       | Finance           |    48000 |
+----+--------------+-------------+-------------------+----------+

In [10]:
mycursor.execute('use SecondDB')

In [11]:
mycursor.execute("""
                 SELECT e.first_name, e.last_name, d.department_name, p.project_name, p.status 
                 FROM employees e 
                 INNER JOIN departments d ON e.department_id = d.department_id 
                 LEFT JOIN projects p ON e.emp_id = p.emp_id;""")
out = mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out, headers=[i[0] for i in mycursor.description], showindex="always", tablefmt='psql'))

+----+--------------+-------------+-------------------+--------------------+-------------+
|    | first_name   | last_name   | department_name   | project_name       | status      |
|----+--------------+-------------+-------------------+--------------------+-------------|
|  0 | John         | Smith       | IT                | Cloud Migration    | Planning    |
|  1 | John         | Smith       | IT                | Website Redesign   | In Progress |
|  2 | Sarah        | Johnson     | Marketing         | Mobile App         | Planning    |
|  3 | Michael      | Brown       | IT                | DevOps Pipeline    | In Progress |
|  4 | Michael      | Brown       | IT                | Database Migration | Completed   |
|  5 | Emily        | Davis       | Finance           | Security Audit     | In Progress |
|  6 | David        | Wilson      | Marketing         | AI Implementation  | On Hold     |
|  7 | Lisa         | Anderson    | HR                |                    |             |
|  8 | James        | Taylor      | IT                | CRM Update         | In Progress |
|  9 | Emma         | Martinez    | Marketing         | Network Upgrade    | Planning    |
| 10 | Daniel       | Thomas      | Finance           | Data Analytics     | Completed   |
| 11 | Jessica      | Garcia      | Sales             |                    |             |
+----+--------------+-------------+-------------------+--------------------+-------------+

In [15]:
mycursor.execute("""
                SELECT d.department_name, COUNT(e.emp_id) as employee_count, AVG(e.salary) as avg_salary 
                 FROM departments d 
                 LEFT JOIN employees e ON d.department_id = e.department_id 
                 GROUP BY d.department_name
                 order by avg_salary desc
""")
out = mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out, headers=[i[0] for i in mycursor.description], showindex="always", tablefmt='psql'))

+----+-------------------+------------------+--------------+
|    | department_name   |   employee_count |   avg_salary |
|----+-------------------+------------------+--------------|
|  0 | Marketing         |                3 |      60666.7 |
|  1 | Sales             |                1 |      57000   |
|  2 | HR                |                1 |      53000   |
|  3 | IT                |                3 |      53000   |
|  4 | Finance           |                2 |      49500   |
|  5 | Operations        |                0 |              |
|  6 | Research          |                0 |              |
|  7 | Legal             |                0 |              |
|  8 | Development       |                0 |              |
|  9 | Support           |                0 |              |
+----+-------------------+------------------+--------------+

In [16]:
mycursor.execute("""
                SELECT e1.first_name as employee1, e2.first_name as employee2, d.department_name 
                 FROM employees e1 
                 INNER JOIN employees e2 ON e1.department_id = e2.department_id 
                 INNER JOIN departments d ON e1.department_id = d.department_id 
                 WHERE e1.emp_id < e2.emp_id;

""")
out = mycursor.fetchall()
from tabulate import tabulate
print(tabulate(out, headers=[i[0] for i in mycursor.description], showindex="always", tablefmt='psql'))

+----+-------------+-------------+-------------------+
|    | employee1   | employee2   | department_name   |
|----+-------------+-------------+-------------------|
|  0 | John        | James       | IT                |
|  1 | John        | Michael     | IT                |
|  2 | Sarah       | Emma        | Marketing         |
|  3 | Sarah       | David       | Marketing         |
|  4 | Michael     | James       | IT                |
|  5 | Emily       | Daniel      | Finance           |
|  6 | David       | Emma        | Marketing         |
+----+-------------+-------------+-------------------+